Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
#byte INDF0 = 0x000

#byte INDF1 = 0x001

#byte PCL = 0x002

struct STATUS {
   unsigned int C:1;
   unsigned int DC:1;
   unsigned int Z:1;
   unsigned int PD:1;
   unsigned int TO:1;
} STATUS;
#byte STATUS = 0x003

#word FSR0 = 0x004

#word FSR1 = 0x006

#byte BSR = 0x008

#byte WREG = 0x009

#byte PCLATH = 0x00A

struct INTCON {
   unsigned int INTEDG:1;
   unsigned int :5;
   unsigned int PEIE:1;
   unsigned int GIE:1;
} INTCON;
#byte INTCON = 0x00B

struct PORTA {
   unsigned int RA0:1;
   unsigned int RA1:1;
   unsigned int RA2:1;
   unsigned int RA3:1;
   unsigned int RA4:1;
   unsigned int RA5:1;
   unsigned int RA6:1;
   unsigned int RA7:1;
} PORTAbits;
#byte PORTA = 0x00C
#byte PORTAbits = 0x00C

struct PORTB {
   unsigned int RB0:1;
   unsigned int RB1:1;
   unsigned int RB2:1;
   unsigned int RB3:1;
   unsigned int RB4:1;
   unsigned int RB5:1;
   unsigned int RB6:1;
   unsigned int RB7:1;
} PORTB;
#byte PORTB = 0x00D

struct PORTC {
   unsigned int RC0:1;
   unsigned int RC1:1;
   unsigned int RC2:1;
   unsigned int RC3:1;
   unsigned int RC4:1;
   unsigned int RC5:1;
   unsigned int RC6:1;
   unsigned int RC7:1;
} PORTC;
#byte PORTC = 0x00E

struct PORTE {
   unsigned int RE0:1;
   unsigned int RE1:1;
   unsigned int RE2:1;
   unsigned int RE3:1;
   unsigned int RE4:1;
   unsigned int RE5:1;
   unsigned int RE6:1;
   unsigned int RE7:1;
} PORTE;
#byte PORTE = 0x010

struct TRISA {
   unsigned int TRISA0:1;
   unsigned int TRISA1:1;
   unsigned int TRISA2:1;
   unsigned int TRISA3:1;
   unsigned int TRISA4:1;
   unsigned int TRISA5:1;
   unsigned int TRISA6:1;
   unsigned int TRISA7:1;
} TRISA;
#byte TRISA = 0x011

struct TRISB {
   unsigned int TRISB0:1;
   unsigned int TRISB1:1;
   unsigned int TRISB2:1;
   unsigned int TRISB3:1;
   unsigned int TRISB4:1;
   unsigned int TRISB5:1;
   unsigned int TRISB6:1;
   unsigned int TRISB7:1;
} TRISB;
#byte TRISB = 0x012

struct TRISC {
   unsigned int TRISC0:1;
   unsigned int TRISC1:1;
   unsigned int TRISC2:1;
   unsigned int TRISC3:1;
   unsigned int TRISC4:1;
   unsigned int TRISC5:1;
   unsigned int TRISC6:1;
   unsigned int TRISC7:1;
} TRISC;
#byte TRISC = 0x013

struct LATA {
   unsigned int LATA0:1;
   unsigned int LATA1:1;
   unsigned int LATA2:1;
   unsigned int LATA3:1;
   unsigned int LATA4:1;
   unsigned int LATA5:1;
   unsigned int LATA6:1;
   unsigned int LATA7:1;
} LATA;
#byte LATA = 0x016

struct LATB {
   unsigned int LATB0:1;
   unsigned int LATB1:1;
   unsigned int LATB2:1;
   unsigned int LATB3:1;
   unsigned int LATB4:1;
   unsigned int LATB5:1;
   unsigned int LATB6:1;
   unsigned int LATB7:1;
} LATB;
#byte LATB = 0x017

struct LATC {
   unsigned int LATC0:1;
   unsigned int LATC1:1;
   unsigned int LATC2:1;
   unsigned int LATC3:1;
   unsigned int LATC4:1;
   unsigned int LATC5:1;
   unsigned int LATC6:1;
   unsigned int LATC7:1;
} LATC;
#byte LATC = 0x018

struct TMR0 {
   unsigned int TMR0L:8;
} TMR0;
#byte TMR0 = 0x01C

struct TMR0H {
   union {
      struct {
         unsigned int TMR0H:8;
      };

      struct {
         unsigned int T0PR:8;
      };
   };
} TMR0H;
#byte TMR0H = 0x01D

struct T0CON0 {
   unsigned int T0OUTPS:4;
   unsigned int T016BIT:1;
   unsigned int T0OUT:1;
   unsigned int T0OE:1;
   unsigned int T0EN:1;
} T0CON0;
#byte T0CON0 = 0x01E

struct T0CON1 {
   unsigned int T0CKPS:4;
   unsigned int T0ASYNC:1;
   unsigned int T0CS:3;
} T0CON1;
#byte T0CON1 = 0x01F

#word ADRES = 0x08C

struct ADPREV {
   unsigned int ADPREV:8;
} ADPREV;
#byte ADPREV = 0x08E

struct ADPREVH {
   unsigned int ADPREV8:2;
   unsigned int ADPREV1:6;
} ADPREVH;
#byte ADPREVH = 0x08F

struct ADACC {
   unsigned int ADACC:8;
} ADACC;
#byte ADACC = 0x090

struct ADACCH {
   unsigned int ADACC8:2;
   unsigned int ADACC1:6;
} ADACCH;
#byte ADACCH = 0x091

struct ADCON0 {
   union {
      struct {
         unsigned int ADGO:1;
         unsigned int :1;
         unsigned int ADFM:2;
         unsigned int ADCS:1;
         unsigned int :1;
         unsigned int ADCONT:1;
         unsigned int ADON:1;
      };

   union {
      struct {
         unsigned int DONE:1;
         unsigned int :1;
         unsigned int ADFRM:2;
      };
   };

      struct {
         unsigned int GO:1;
      };
   };
} ADCON0;
#byte ADCON0 = 0x093

struct ADCON1 {
   unsigned int ADDSEN:1;
   unsigned int :4;
   unsigned int ADGPOL:1;
   unsigned int ADIPEN:1;
   unsigned int ADPPOL:1;
} ADCON1;
#byte ADCON1 = 0x094

struct ADCON2 {
   unsigned int ADMD:3;
   unsigned int ADACLR:1;
   unsigned int ADCRS:3;
   unsigned int ADPSIS:1;
} ADCON2;
#byte ADCON2 = 0x095

struct ADCON3 {
   unsigned int ADTMD:3;
   unsigned int ADSOI:1;
   unsigned int ADCALC:3;
} ADCON3;
#byte ADCON3 = 0x096

struct ADSTAT {
   unsigned int ADSTAT:3;
   unsigned int ADMACT:1;
   unsigned int ADMATH:1;
   unsigned int ADLTHR:1;
   unsigned int ADUTHR:1;
   unsigned int ADAOV:1;
} ADSTAT;
#byte ADSTAT = 0x097

#byte ADCLK = 0x098

#byte ADACT = 0x099

struct ADREF {
   unsigned int ADPREF:2;
   unsigned int :2;
   unsigned int ADNREF:1;
} ADREF;
#byte ADREF = 0x09A

#byte ADCAP = 0x09B

struct ADPRE {
   unsigned int ADPRE:8;
} ADPRE;
#byte ADPRE = 0x09C

struct ADACQ {
   unsigned int ADACQ:8;
} ADACQ;
#byte ADACQ = 0x09D

#byte ADPCH = 0x09E

struct ADCNT {
   unsigned int ADCNT:8;
} ADCNT;
#byte ADCNT = 0x10C

struct ADRPT {
   unsigned int ADRPT:8;
} ADRPT;
#byte ADRPT = 0x10D

struct ADLTH {
   unsigned int ADLTH:8;
} ADLTH;
#byte ADLTH = 0x10E

struct ADLTHH {
   unsigned int ADLTH8:2;
   unsigned int ADLTH1:6;
} ADLTHH;
#byte ADLTHH = 0x10F

struct ADUTH {
   unsigned int ADUTH:8;
} ADUTH;
#byte ADUTH = 0x110

struct ADUTHH {
   unsigned int ADUTH8:2;
   unsigned int ADUTH1:6;
} ADUTHH;
#byte ADUTHH = 0x111

struct ADSTPT {
   unsigned int ADSTPT:8;
} ADSTPT;
#byte ADSTPT = 0x112

struct ADSTPTH {
   unsigned int ADSTPT8:2;
   unsigned int ADSTPT1:6;
} ADSTPTH;
#byte ADSTPTH = 0x113

struct ADFLTR {
   unsigned int ADFLTR:8;
} ADFLTR;
#byte ADFLTR = 0x114

struct ADFLTRH {
   unsigned int ADFLTR8:2;
   unsigned int ADFLTR1:6;
} ADFLTRH;
#byte ADFLTRH = 0x115

struct ADERR {
   unsigned int ADERR:8;
} ADERR;
#byte ADERR = 0x116

struct ADERRH {
   unsigned int ADERR8:2;
   unsigned int ADERR1:6;
} ADERRH;
#byte ADERRH = 0x117

