Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
#byte RC1REG = 0x119

#byte TX1REG = 0x11A

#word SP1BRG = 0x11B

struct RC1STA {
   unsigned int RX9D:1;
   unsigned int OERR:1;
   unsigned int FERR:1;
   unsigned int ADDEN:1;
   unsigned int CREN:1;
   unsigned int SREN:1;
   unsigned int RX9:1;
   unsigned int SPEN:1;
} RC1STA;
#byte RC1STA = 0x11D

struct TX1STA {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX9:1;
   unsigned int CSRC:1;
} TX1STA;
#byte TX1STA = 0x11E

struct BAUD1CON {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG16:1;
   unsigned int SCKP:1;
   unsigned int :1;
   unsigned int RCIDL:1;
   unsigned int ABDOVF:1;
} BAUD1CON;
#byte BAUD1CON = 0x11F

#byte SSP1BUF = 0x18C


struct SSP1ADD {
   unsigned int MSK:8;
} SSP1ADD;
#byte SSP1ADD = 0x18D


struct SSP1MSK {
   unsigned int MSK:8;
} SSP1MSK;
#byte SSP1MSK = 0x18E

struct SSP1STAT {
   union {
      struct {
         unsigned int BF:1;
         unsigned int UA:1;
         unsigned int R:1;
         unsigned int S:1;
         unsigned int P:1;
         unsigned int D:1;
         unsigned int CKE:1;
         unsigned int SMP:1;
      };

   union {
      struct {
         unsigned int :2;
         unsigned int R_W:1;
         unsigned int :2;
         unsigned int D_A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int W:1;
         unsigned int :2;
         unsigned int A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int WRITE:1;
         unsigned int S2:1;
         unsigned int P2:1;
         unsigned int ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int READ_WRITE:1;
         unsigned int I2C_START:1;
         unsigned int I2C_STOP:1;
         unsigned int DATA_ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int BF1:1;
         unsigned int UA1:1;
         unsigned int I2C_READ:1;
         unsigned int START:1;
         unsigned int STOP:1;
         unsigned int I2C_DAT:1;
         unsigned int CKE1:1;
         unsigned int SMP1:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int RW:1;
         unsigned int I2C_START1:1;
         unsigned int I2C_STOP2:1;
         unsigned int DA:1;
      };
   };

      struct {
         unsigned int :2;
         unsigned int W2:1;
         unsigned int :2;
         unsigned int A2:1;
      };
   };
} SSP1STAT;
#byte SSP1STAT = 0x18F

struct SSP1CON1 {
   unsigned int SSPM:4;
   unsigned int CKP:1;
   unsigned int SSPEN:1;
   unsigned int SSPOV:1;
   unsigned int WCOL:1;
} SSP1CON1;
#byte SSP1CON1 = 0x190

struct SSP1CON2 {
   union {
      struct {
         unsigned int SEN:1;
         unsigned int RSEN:1;
         unsigned int PEN:1;
         unsigned int RCEN:1;
         unsigned int ACKEN:1;
         unsigned int ACKDT:1;
         unsigned int ACKSTAT:1;
         unsigned int GCEN:1;
      };

   union {
      struct {
         unsigned int :1;
         unsigned int ADMSK:5;
      };
   };

      struct {
         unsigned int SEN1:1;
         unsigned int ADMSK1:5;
         unsigned int ACKSTAT1:1;
         unsigned int GCEN1:1;
      };
   };
} SSP1CON2;
#byte SSP1CON2 = 0x191

struct SSP1CON3 {
   unsigned int DHEN:1;
   unsigned int AHEN:1;
   unsigned int SBCDE:1;
   unsigned int SDAHT:1;
   unsigned int BOEN:1;
   unsigned int SCIE:1;
   unsigned int PCIE:1;
   unsigned int ACKTIM:1;
} SSP1CON3;
#byte SSP1CON3 = 0x192

#byte SSP2BUF = 0x196


struct SSP2ADD {
   union {
      struct {
         unsigned int MSK:8;
      };

      struct {
         unsigned int MSK02:1;
         unsigned int MSK12:1;
         unsigned int MSK22:1;
         unsigned int MSK32:1;
         unsigned int MSK42:1;
         unsigned int MSK52:1;
         unsigned int :1;
         unsigned int MSK72:1;
      };
   };
} SSP2ADD;
#byte SSP2ADD = 0x197


struct SSP2MSK {
   unsigned int MSK:8;
} SSP2MSK;
#byte SSP2MSK = 0x198

struct SSP2STAT {
   union {
      struct {
         unsigned int BF:1;
         unsigned int UA:1;
         unsigned int R:1;
         unsigned int S:1;
         unsigned int P:1;
         unsigned int D:1;
         unsigned int CKE:1;
         unsigned int SMP:1;
      };

   union {
      struct {
         unsigned int :2;
         unsigned int R_W:1;
         unsigned int :2;
         unsigned int D_A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int W:1;
         unsigned int :2;
         unsigned int A:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int WRITE:1;
         unsigned int START2:1;
         unsigned int STOP2:1;
         unsigned int ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int READ_WRITE:1;
         unsigned int I2C_START:1;
         unsigned int I2C_STOP:1;
         unsigned int DATA_ADDRESS:1;
      };
   };

   union {
      struct {
         unsigned int BF2:1;
         unsigned int UA2:1;
         unsigned int I2C_READ:1;
         unsigned int START:1;
         unsigned int STOP:1;
         unsigned int I2C_DAT:1;
         unsigned int CKE2:1;
         unsigned int SMP2:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int RW:1;
         unsigned int I2C_START2:1;
         unsigned int I2C_STOP2:1;
         unsigned int DA:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int RW2:1;
         unsigned int S2:1;
         unsigned int P2:1;
         unsigned int DA2:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int I2C_READ2:1;
         unsigned int :2;
         unsigned int DATA_ADDRESS2:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int READ_WRITE2:1;
         unsigned int :2;
         unsigned int D_A2:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int R_W2:1;
         unsigned int :2;
         unsigned int I2C_DAT2:1;
      };
   };

   union {
      struct {
         unsigned int :2;
         unsigned int W2:1;
         unsigned int :2;
         unsigned int A2:1;
      };
   };

