Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
struct CCP3CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP3CTS:8;
      };
   };
} CCP3CAP;
#byte CCP3CAP = 0x317

#word CCPR4 = 0x318

struct CCP4CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP4MODE:4;
         unsigned int CCP4FMT:1;
         unsigned int CCP4OUT:1;
         unsigned int CCP4OE:1;
         unsigned int CCP4EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P4M:2;
      };
   };
} CCP4CON;
#byte CCP4CON = 0x31A


struct CCP4CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP4CTS:8;
      };
   };
} CCP4CAP;
#byte CCP4CAP = 0x31B

#word CCPR5 = 0x31C

struct CCP5CON {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int FMT:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CCP5MODE:4;
         unsigned int CCP5FMT:1;
         unsigned int CCP5OUT:1;
         unsigned int CCP5OE:1;
         unsigned int CCP5EN:1;
      };
   };

      struct {
         unsigned int :6;
         unsigned int P5M:2;
      };
   };
} CCP5CON;
#byte CCP5CON = 0x31E

struct CCP5CAP {
   union {
      struct {
         unsigned int CTS:8;
      };

      struct {
         unsigned int CCP5CTS:8;
      };
   };
} CCP5CAP;
#byte CCP5CAP = 0x31F

struct PWM6DCL {
   union {
      struct {
         unsigned int :6;
         unsigned int DC:2;
      };

   union {
      struct {
         unsigned int :6;
         unsigned int PWM6DC:2;
      };
   };

      struct {
         unsigned int :6;
         unsigned int PWMPW:2;
      };
   };
} PWM6DC;
#byte PWM6DC = 0x38C

struct PWM6DCH {
   union {
      struct {
         unsigned int DC2:8;
      };

   union {
      struct {
         unsigned int PWM6DC2:8;
      };
   };

      struct {
         unsigned int PWMPW2:8;
      };
   };
} PWM6DCH;
#byte PWM6DCH = 0x38D

struct PWM6CON {
   union {
      struct {
         unsigned int :4;
         unsigned int POL:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

      struct {
         unsigned int :4;
         unsigned int PWM6POL:1;
         unsigned int PWM6OUT:1;
         unsigned int PWM6OE:1;
         unsigned int PWM6EN:1;
      };
   };
} PWM6CON;
#byte PWM6CON = 0x38E

struct PWM7DCL {
   union {
      struct {
         unsigned int :6;
         unsigned int DC:2;
      };

   union {
      struct {
         unsigned int :6;
         unsigned int PWM7DC:2;
      };
   };

      struct {
         unsigned int :6;
         unsigned int PWMPW:2;
      };
   };
} PWM7DC;
#byte PWM7DC = 0x390

struct PWM7DCH {
   union {
      struct {
         unsigned int DC2:8;
      };

   union {
      struct {
         unsigned int PWM7DC2:8;
      };
   };

      struct {
         unsigned int PWMPW2:8;
      };
   };
} PWM7DCH;
#byte PWM7DCH = 0x391

struct PWM7CON {
   union {
      struct {
         unsigned int :4;
         unsigned int POL:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };

      struct {
         unsigned int :4;
         unsigned int PWM7POL:1;
         unsigned int PWM7OUT:1;
         unsigned int PWM7OE:1;
         unsigned int PWM7EN:1;
      };
   };
} PWM7CON;
#byte PWM7CON = 0x392


struct SCANLADRL {
   union {
      struct {
         unsigned int LADR:8;
      };

      struct {
         unsigned int SCANLADR:8;
      };
   };
} SCANLADR;
#byte SCANLADR = 0x40C


struct SCANLADRH {
   union {
      struct {
         unsigned int LADR8:2;
         unsigned int LADR1:6;
      };

      struct {
         unsigned int SCANLADR8:2;
         unsigned int SCANLADR1:6;
      };
   };
} SCANLADRH;
#byte SCANLADRH = 0x40D


struct SCANHADRL {
   union {
      struct {
         unsigned int HADR:8;
      };

      struct {
         unsigned int SCANHADR:8;
      };
   };
} SCANHADR;
#byte SCANHADR = 0x40E


struct SCANHADRH {
   union {
      struct {
         unsigned int HADR8:2;
         unsigned int HADR1:6;
      };

      struct {
         unsigned int SCANHADR8:2;
         unsigned int SCANHADR1:6;
      };
   };
} SCANHADRH;
#byte SCANHADRH = 0x40F

struct SCANCON0 {
   union {
      struct {
         unsigned int MODE:2;
         unsigned int :1;
         unsigned int INTM:1;
         unsigned int INVALID:1;
         unsigned int BUSY:1;
         unsigned int SCANGO:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int SCANMODE:2;
         unsigned int :1;
         unsigned int SCANINTM:1;
         unsigned int SCANINVALID:1;
         unsigned int SCANBUSY:1;
         unsigned int :1;
         unsigned int SCANEN:1;
      };
   };

      struct {
         unsigned int :4;
         unsigned int DABORT:1;
      };
   };
} SCANCON0;
#byte SCANCON0 = 0x410

#byte SCANTRIG = 0x411

struct CRCDAT {
   unsigned int DATA:8;
} CRCDAT;
#byte CRCDAT = 0x416

struct CRCDATH {
   unsigned int DATA8:2;
   unsigned int DATA1:6;
} CRCDATH;
#byte CRCDATH = 0x417

struct CRCACC {
   unsigned int ACC:8;
} CRCACC;
#byte CRCACC = 0x418

struct CRCACCH {
   unsigned int ACC8:2;
   unsigned int ACC1:6;
} CRCACCH;
#byte CRCACCH = 0x419

struct CRCSHIFT {
   unsigned int SHFT:8;
} CRCSHIFT;
#byte CRCSHIFT = 0x41A

struct CRCSHIFTH {
   unsigned int SHFT8:2;
   unsigned int SHFT1:6;
} CRCSHIFTH;
#byte CRCSHIFTH = 0x41B

struct CRCXOR {
   unsigned int :1;
   unsigned int X1:7;
} CRCXOR;
#byte CRCXOR = 0x41C

struct CRCXORH {
   unsigned int X8:2;
   unsigned int X1:6;
} CRCXORH;
#byte CRCXORH = 0x41D

struct CRCCON0 {
   union {
      struct {
         unsigned int FULL:1;
         unsigned int SHIFTM:1;
         unsigned int :2;
         unsigned int ACCM:1;
         unsigned int BUSY:1;
         unsigned int CRCGO:1;
         unsigned int EN:1;
      };

