Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
      struct {
         unsigned int :7;
         unsigned int CRCEN:1;
      };
   };
} CRCCON0;
#byte CRCCON0 = 0x41E

struct CRCCON1 {
   unsigned int PLEN:4;
   unsigned int DLEN:4;
} CRCCON1;
#byte CRCCON1 = 0x41F

struct SMT1TMRL {
   union {
      struct {
         unsigned int TMR:8;
      };

      struct {
         unsigned int SMT1TMR:8;
      };
   };
} SMT1TMR;
#byte SMT1TMR = 0x48C

struct SMT1TMRH {
   union {
      struct {
         unsigned int TMR8:2;
         unsigned int TMR1:6;
      };

      struct {
         unsigned int SMT1TMR8:2;
         unsigned int SMT1TMR1:6;
      };
   };
} SMT1TMRH;
#byte SMT1TMRH = 0x48D

struct SMT1TMRU {
   union {
      struct {
         unsigned int TMR16:4;
         unsigned int TMR2:4;
      };

      struct {
         unsigned int SMT1TMR16:4;
         unsigned int SMT1TMR2:4;
      };
   };
} SMT1TMRU;
#byte SMT1TMRU = 0x48E

struct SMT1CPRL {
   union {
      struct {
         unsigned int CPR:8;
      };

      struct {
         unsigned int SMT1CPR:8;
      };
   };
} SMT1CPR;
#byte SMT1CPR = 0x48F

struct SMT1CPRH {
   union {
      struct {
         unsigned int CPR8:2;
         unsigned int CPR1:6;
      };

      struct {
         unsigned int SMT1CPR8:2;
         unsigned int SMT1CPR1:6;
      };
   };
} SMT1CPRH;
#byte SMT1CPRH = 0x490

struct SMT1CPRU {
   union {
      struct {
         unsigned int CPR16:4;
         unsigned int CPR2:4;
      };

      struct {
         unsigned int SMT1CPR16:4;
         unsigned int SMT1CPR2:4;
      };
   };
} SMT1CPRU;
#byte SMT1CPRU = 0x491

struct SMT1CPWL {
   union {
      struct {
         unsigned int CPW:8;
      };

      struct {
         unsigned int SMT1CPW:8;
      };
   };
} SMT1CPW;
#byte SMT1CPW = 0x492

struct SMT1CPWH {
   union {
      struct {
         unsigned int CPW8:2;
         unsigned int CPW1:6;
      };

      struct {
         unsigned int SMT1CPW8:2;
         unsigned int SMT1CPW1:6;
      };
   };
} SMT1CPWH;
#byte SMT1CPWH = 0x493

struct SMT1CPWU {
   union {
      struct {
         unsigned int CPW16:4;
         unsigned int CPW2:4;
      };

      struct {
         unsigned int SMT1CPW16:4;
         unsigned int SMT1CPW2:4;
      };
   };
} SMT1CPWU;
#byte SMT1CPWU = 0x494

struct SMT1PRL {
   union {
      struct {
         unsigned int PR:8;
      };

      struct {
         unsigned int SMT1PR:8;
      };
   };
} SMT1PR;
#byte SMT1PR = 0x495

struct SMT1PRH {
   union {
      struct {
         unsigned int PR8:2;
         unsigned int PR1:6;
      };

      struct {
         unsigned int SMT1PR8:2;
         unsigned int SMT1PR1:6;
      };
   };
} SMT1PRH;
#byte SMT1PRH = 0x496

struct SMT1PRU {
   union {
      struct {
         unsigned int PR16:4;
         unsigned int PR2:4;
      };

      struct {
         unsigned int SMT1PR16:4;
         unsigned int SMT1PR2:4;
      };
   };
} SMT1PRU;
#byte SMT1PRU = 0x497

struct SMT1CON0 {
   union {
      struct {
         unsigned int PS:2;
         unsigned int CPOL:1;
         unsigned int SPOL:1;
         unsigned int WPOL:1;
         unsigned int STP:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int SMT1PS:2;
         unsigned int SMT1CPOL:1;
         unsigned int SMT1SPOL:1;
         unsigned int SMT1WOL:1;
         unsigned int SMT1STP:1;
         unsigned int :1;
         unsigned int SMT1EN:1;
      };
   };
} SMT1CON0;
#byte SMT1CON0 = 0x498

struct SMT1CON1 {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int :2;
         unsigned int REPEAT:1;
         unsigned int GO:1;
      };

      struct {
         unsigned int :6;
         unsigned int SMT1REPEAT:1;
         unsigned int SMT1GO:1;
      };
   };
} SMT1CON1;
#byte SMT1CON1 = 0x499

struct SMT1STAT {
   union {
      struct {
         unsigned int AS:1;
         unsigned int WS:1;
         unsigned int TS:1;
         unsigned int :2;
         unsigned int RST:1;
         unsigned int CPWUP:1;
         unsigned int CPRUP:1;
      };

   union {
      struct {
         unsigned int SMT1AS:1;
         unsigned int SMT1WS:1;
         unsigned int SMT1TS:1;
         unsigned int :2;
         unsigned int SMT1RESET:1;
         unsigned int SMT1CPWUP:1;
         unsigned int SMT1CPRUP:1;
      };
   };

      struct {
         unsigned int :5;
         unsigned int SMT1RST:1;
      };
   };
} SMT1STAT;
#byte SMT1STAT = 0x49A

#byte SMT1CLK = 0x49B

#byte SMT1SIG = 0x49C

#byte SMT1WIN = 0x49D

struct SMT2TMRL {
   union {
      struct {
         unsigned int TMR:8;
      };

      struct {
         unsigned int SMT2TMR:8;
      };
   };
} SMT2TMR;
#byte SMT2TMR = 0x50C

struct SMT2TMRH {
   union {
      struct {
         unsigned int TMR8:2;
         unsigned int TMR1:6;
      };

      struct {
         unsigned int SMT2TMR8:2;
         unsigned int SMT2TMR1:6;
      };
   };
} SMT2TMRH;
#byte SMT2TMRH = 0x50D

struct SMT2TMRU {
   union {
      struct {
         unsigned int TMR16:4;
         unsigned int TMR2:4;
      };

      struct {
         unsigned int SMT2TMR16:4;
         unsigned int SMT2TMR2:4;
      };
   };
} SMT2TMRU;
#byte SMT2TMRU = 0x50E

struct SMT2CPRL {
   union {
      struct {
         unsigned int CPR:8;
      };

      struct {
         unsigned int SMT2CPR:8;
      };
   };
} SMT2CPR;
#byte SMT2CPR = 0x50F

struct SMT2CPRH {
   union {
      struct {
         unsigned int CPR8:2;
         unsigned int CPR1:6;
      };

      struct {
         unsigned int SMT2CPR8:2;
         unsigned int SMT2CPR1:6;
      };
   };
} SMT2CPRH;
#byte SMT2CPRH = 0x510

struct SMT2CPRU {
   union {
      struct {
         unsigned int CPR16:4;
         unsigned int CPR2:4;
      };

      struct {
         unsigned int SMT2CPR16:4;
         unsigned int SMT2CPR2:4;
      };
   };
} SMT2CPRU;
#byte SMT2CPRU = 0x511

struct SMT2CPWL {
   union {
      struct {
         unsigned int CPW:8;
      };

      struct {
         unsigned int SMT2CPW:8;
      };
   };
} SMT2CPW;
#byte SMT2CPW = 0x512

struct SMT2CPWH {
   union {
      struct {
         unsigned int CPW8:2;
         unsigned int CPW1:6;
      };

