Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
      struct {
         unsigned int SMT2CPW8:2;
         unsigned int SMT2CPW1:6;
      };
   };
} SMT2CPWH;
#byte SMT2CPWH = 0x513

struct SMT2CPWU {
   union {
      struct {
         unsigned int CPW16:4;
         unsigned int CPW2:4;
      };

      struct {
         unsigned int SMT2CPW16:4;
         unsigned int SMT2CPW2:4;
      };
   };
} SMT2CPWU;
#byte SMT2CPWU = 0x514

struct SMT2PRL {
   union {
      struct {
         unsigned int PR:8;
      };

      struct {
         unsigned int SMT2PR:8;
      };
   };
} SMT2PR;
#byte SMT2PR = 0x515

struct SMT2PRH {
   union {
      struct {
         unsigned int PR8:2;
         unsigned int PR1:6;
      };

      struct {
         unsigned int SMT2PR8:2;
         unsigned int SMT2PR1:6;
      };
   };
} SMT2PRH;
#byte SMT2PRH = 0x516

struct SMT2PRU {
   union {
      struct {
         unsigned int PR16:4;
         unsigned int PR2:4;
      };

      struct {
         unsigned int SMT2PR16:4;
         unsigned int SMT2PR2:4;
      };
   };
} SMT2PRU;
#byte SMT2PRU = 0x517

struct SMT2CON0 {
   union {
      struct {
         unsigned int PS:2;
         unsigned int CPOL:1;
         unsigned int SPOL:1;
         unsigned int WPOL:1;
         unsigned int STP:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int SMT2PS:2;
         unsigned int SMT2CPOL:1;
         unsigned int SMT2SPOL:1;
         unsigned int SMT2WOL:1;
         unsigned int SMT2STP:1;
         unsigned int :1;
         unsigned int SMT2EN:1;
      };
   };
} SMT2CON0;
#byte SMT2CON0 = 0x518

struct SMT2CON1 {
   union {
      struct {
         unsigned int MODE:4;
         unsigned int :2;
         unsigned int REPEAT:1;
         unsigned int GO:1;
      };

      struct {
         unsigned int :6;
         unsigned int SMT2REPEAT:1;
         unsigned int SMT2GO:1;
      };
   };
} SMT2CON1;
#byte SMT2CON1 = 0x519

struct SMT2STAT {
   union {
      struct {
         unsigned int AS:1;
         unsigned int WS:1;
         unsigned int TS:1;
         unsigned int :2;
         unsigned int RST:1;
         unsigned int CPWUP:1;
         unsigned int CPRUP:1;
      };

   union {
      struct {
         unsigned int SMT2AS:1;
         unsigned int SMT2WS:1;
         unsigned int SMT2TS:1;
         unsigned int :2;
         unsigned int SMT2RESET:1;
         unsigned int SMT2CPWUP:1;
         unsigned int SMT2CPRUP:1;
      };
   };

      struct {
         unsigned int :5;
         unsigned int SMT2RST:1;
      };
   };
} SMT2STAT;
#byte SMT2STAT = 0x51A

#byte SMT2CLK = 0x51B

#byte SMT2SIG = 0x51C

#byte SMT2WIN = 0x51D

struct NCO1ACC {
   unsigned int NCO1ACC:8;
} NCO1ACC;
#byte NCO1ACC = 0x58C

struct NCO1ACCH {
   unsigned int NCO1ACC8:2;
   unsigned int NCO1ACC1:6;
} NCO1ACCH;
#byte NCO1ACCH = 0x58D

struct NCO1ACCU {
   unsigned int NCO1ACC16:4;
   unsigned int NCO1ACC2:4;
} NCO1ACCU;
#byte NCO1ACCU = 0x58E

struct NCO1INC {
   unsigned int NCO1INC:8;
} NCO1INC;
#byte NCO1INC = 0x58F

struct NCO1INCH {
   unsigned int NCO1INC8:2;
   unsigned int NCO1INC1:6;
} NCO1INCH;
#byte NCO1INCH = 0x590

struct NCO1INCU {
   unsigned int NCO1INC16:4;
   unsigned int NCO1INC2:4;
} NCO1INCU;
#byte NCO1INCU = 0x591

struct NCO1CON {
   unsigned int N1PFM:1;
   unsigned int :3;
   unsigned int N1POL:1;
   unsigned int N1OUT:1;
   unsigned int N1OE:1;
   unsigned int N1EN:1;
} NCO1CON;
#byte NCO1CON = 0x592

struct NCO1CLK {
   unsigned int N1CKS:4;
   unsigned int :1;
   unsigned int N1PWS:3;
} NCO1CLK;
#byte NCO1CLK = 0x593

struct CWG1CLKCON {
   union {
      struct {
         unsigned int CS:1;
      };

      struct {
         unsigned int CWG1CS:1;
      };
   };
} CWG1CLKCON;
#byte CWG1CLKCON = 0x60C

#byte CWG1ISM = 0x60D

#byte CWG1DBR = 0x60E

#byte CWG1DBF = 0x60F

struct CWG1CON0 {
   union {
      struct {
         unsigned int MODE:3;
         unsigned int :3;
         unsigned int LD:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CWG1MODE:3;
         unsigned int :3;
         unsigned int CWG1LD:1;
         unsigned int G1EN:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int CWG1EN:1;
      };
   };
} CWG1CON0;
#byte CWG1CON0 = 0x610

struct CWG1CON1 {
   union {
      struct {
         unsigned int POLA:1;
         unsigned int POLB:1;
         unsigned int POLC:1;
         unsigned int POLD:1;
         unsigned int :1;
         unsigned int IN:1;
      };

      struct {
         unsigned int CWG1POLA:1;
         unsigned int CWG1POLB:1;
         unsigned int CWG1POLC:1;
         unsigned int CWG1POLD:1;
         unsigned int :1;
         unsigned int CWG1IN:1;
      };
   };
} CWG1CON1;
#byte CWG1CON1 = 0x611

struct CWG1AS0 {
   union {
      struct {
         unsigned int :2;
         unsigned int LSAC:2;
         unsigned int LSBD:2;
         unsigned int REN:1;
         unsigned int SHUTDOWN:1;
      };

      struct {
         unsigned int :2;
         unsigned int CWG1LSAC:2;
         unsigned int CWG1LSBD:2;
         unsigned int CWG1REN:1;
         unsigned int CWG1SHUTDOWN:1;
      };
   };
} CWG1AS0;
#byte CWG1AS0 = 0x612

struct CWG1AS1 {
   unsigned int AS0E:1;
   unsigned int AS1E:1;
   unsigned int AS2E:1;
   unsigned int AS3E:1;
   unsigned int AS4E:1;
   unsigned int AS5E:1;
   unsigned int AS6E:1;
} CWG1AS1;
#byte CWG1AS1 = 0x613

struct CWG1STR {
   union {
      struct {
         unsigned int STRA:1;
         unsigned int STRB:1;
         unsigned int STRC:1;
         unsigned int STRD:1;
         unsigned int OVRA:1;
         unsigned int OVRB:1;
         unsigned int OVRC:1;
         unsigned int OVRD:1;
      };

      struct {
         unsigned int CWG1STRA:1;
         unsigned int CWG1STRB:1;
         unsigned int CWG1STRC:1;
         unsigned int CWG1STRD:1;
         unsigned int CWG1OVRA:1;
         unsigned int CWG1OVRB:1;
         unsigned int CWG1OVRC:1;
         unsigned int CWG1OVRD:1;
      };
   };
} CWG1STR;
#byte CWG1STR = 0x614

