Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
struct CWG2CLKCON {
   union {
      struct {
         unsigned int CS:1;
      };

      struct {
         unsigned int CWG2CS:1;
      };
   };
} CWG2CLKCON;
#byte CWG2CLKCON = 0x616

#byte CWG2ISM = 0x617

#byte CWG2DBR = 0x618

#byte CWG2DBF = 0x619

struct CWG2CON0 {
   union {
      struct {
         unsigned int MODE:3;
         unsigned int :3;
         unsigned int LD:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CWG2MODE:3;
         unsigned int :3;
         unsigned int CWG2LD:1;
         unsigned int G2EN:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int CWG2EN:1;
      };
   };
} CWG2CON0;
#byte CWG2CON0 = 0x61A

struct CWG2CON1 {
   union {
      struct {
         unsigned int POLA:1;
         unsigned int POLB:1;
         unsigned int POLC:1;
         unsigned int POLD:1;
         unsigned int :1;
         unsigned int IN:1;
      };

      struct {
         unsigned int CWG2POLA:1;
         unsigned int CWG2POLB:1;
         unsigned int CWG2POLC:1;
         unsigned int CWG2POLD:1;
         unsigned int :1;
         unsigned int CWG2IN:1;
      };
   };
} CWG2CON1;
#byte CWG2CON1 = 0x61B

struct CWG2AS0 {
   union {
      struct {
         unsigned int :2;
         unsigned int LSAC:2;
         unsigned int LSBD:2;
         unsigned int REN:1;
         unsigned int SHUTDOWN:1;
      };

      struct {
         unsigned int :2;
         unsigned int CWG2LSAC:2;
         unsigned int CWG2LSBD:2;
         unsigned int CWG2REN:1;
         unsigned int CWG2SHUTDOWN:1;
      };
   };
} CWG2AS0;
#byte CWG2AS0 = 0x61C

struct CWG2AS1 {
   unsigned int AS0E:1;
   unsigned int AS1E:1;
   unsigned int AS2E:1;
   unsigned int AS3E:1;
   unsigned int AS4E:1;
   unsigned int AS5E:1;
   unsigned int AS6E:1;
} CWG2AS1;
#byte CWG2AS1 = 0x61D

struct CWG2STR {
   union {
      struct {
         unsigned int STRA:1;
         unsigned int STRB:1;
         unsigned int STRC:1;
         unsigned int STRD:1;
         unsigned int OVRA:1;
         unsigned int OVRB:1;
         unsigned int OVRC:1;
         unsigned int OVRD:1;
      };

      struct {
         unsigned int CWG2STRA:1;
         unsigned int CWG2STRB:1;
         unsigned int CWG2STRC:1;
         unsigned int CWG2STRD:1;
         unsigned int CWG2OVRA:1;
         unsigned int CWG2OVRB:1;
         unsigned int CWG2OVRC:1;
         unsigned int CWG2OVRD:1;
      };
   };
} CWG2STR;
#byte CWG2STR = 0x61E

struct CWG3CLKCON {
   union {
      struct {
         unsigned int CS:1;
      };

      struct {
         unsigned int CWG3CS:1;
      };
   };
} CWG3CLKCON;
#byte CWG3CLKCON = 0x68C

#byte CWG3ISM = 0x68D

#byte CWG3DBR = 0x68E

#byte CWG3DBF = 0x68F

struct CWG3CON0 {
   union {
      struct {
         unsigned int MODE:3;
         unsigned int :3;
         unsigned int LD:1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int CWG3MODE:3;
         unsigned int :3;
         unsigned int CWG3LD:1;
         unsigned int G3EN:1;
      };
   };

      struct {
         unsigned int :7;
         unsigned int CWG3EN:1;
      };
   };
} CWG3CON0;
#byte CWG3CON0 = 0x690

struct CWG3CON1 {
   union {
      struct {
         unsigned int POLA:1;
         unsigned int POLB:1;
         unsigned int POLC:1;
         unsigned int POLD:1;
         unsigned int :1;
         unsigned int IN:1;
      };

      struct {
         unsigned int CWG3POLA:1;
         unsigned int CWG3POLB:1;
         unsigned int CWG3POLC:1;
         unsigned int CWG3POLD:1;
         unsigned int :1;
         unsigned int CWG3IN:1;
      };
   };
} CWG3CON1;
#byte CWG3CON1 = 0x691

struct CWG3AS0 {
   union {
      struct {
         unsigned int :2;
         unsigned int LSAC:2;
         unsigned int LSBD:2;
         unsigned int REN:1;
         unsigned int SHUTDOWN:1;
      };

      struct {
         unsigned int :2;
         unsigned int CWG3LSAC:2;
         unsigned int CWG3LSBD:2;
         unsigned int CWG3REN:1;
         unsigned int CWG3SHUTDOWN:1;
      };
   };
} CWG3AS0;
#byte CWG3AS0 = 0x692

struct CWG3AS1 {
   unsigned int AS0E:1;
   unsigned int AS1E:1;
   unsigned int AS2E:1;
   unsigned int AS3E:1;
   unsigned int AS4E:1;
   unsigned int AS5E:1;
   unsigned int AS6E:1;
} CWG3AS1;
#byte CWG3AS1 = 0x693

struct CWG3STR {
   union {
      struct {
         unsigned int STRA:1;
         unsigned int STRB:1;
         unsigned int STRC:1;
         unsigned int STRD:1;
         unsigned int OVRA:1;
         unsigned int OVRB:1;
         unsigned int OVRC:1;
         unsigned int OVRD:1;
      };

      struct {
         unsigned int CWG3STRA:1;
         unsigned int CWG3STRB:1;
         unsigned int CWG3STRC:1;
         unsigned int CWG3STRD:1;
         unsigned int CWG3OVRA:1;
         unsigned int CWG3OVRB:1;
         unsigned int CWG3OVRC:1;
         unsigned int CWG3OVRD:1;
      };
   };
} CWG3STR;
#byte CWG3STR = 0x694

struct PIR0 {
   unsigned int INTF:1;
   unsigned int :3;
   unsigned int IOCIF:1;
   unsigned int TMR0IF:1;
} PIR0;
#byte PIR0 = 0x70C

struct PIR1 {
   unsigned int ADIF:1;
   unsigned int ADTIF:1;
   unsigned int :4;
   unsigned int CSWIF:1;
   unsigned int OSFIF:1;
} PIR1;
#byte PIR1 = 0x70D

struct PIR2 {
   unsigned int C1IF:1;
   unsigned int C2IF:1;
   unsigned int :4;
   unsigned int ZCDIF:1;
} PIR2;
#byte PIR2 = 0x70E

struct PIR3 {
   unsigned int SSP1IF:1;
   unsigned int BCL1IF:1;
   unsigned int SSP2IF:1;
   unsigned int BCL2IF:1;
   unsigned int TXIF:1;
   unsigned int RCIF:1;
} PIR3;
#byte PIR3 = 0x70F

struct PIR4 {
   unsigned int TMR1IF:1;
   unsigned int TMR2IF:1;
   unsigned int TMR3IF:1;
   unsigned int TMR4IF:1;
   unsigned int TMR5IF:1;
   unsigned int TMR6IF:1;
} PIR4;
#byte PIR4 = 0x710

struct PIR5 {
   unsigned int TMR1GIF:1;
   unsigned int TMR3GIF:1;
   unsigned int TMR5GIF:1;
   unsigned int :1;
   unsigned int CLC1IF:1;
   unsigned int CLC2IF:1;
   unsigned int CLC3IF:1;
   unsigned int CLC4IF:1;
} PIR5;
#byte PIR5 = 0x711

