Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
struct PIR6 {
   unsigned int CCP1IF:1;
   unsigned int CCP2IF:1;
   unsigned int CCP3IF:1;
   unsigned int CCP4IF:1;
   unsigned int CCP5IF:1;
} PIR6;
#byte PIR6 = 0x712

struct PIR7 {
   union {
      struct {
         unsigned int CWG1IF:1;
         unsigned int CWG2IF:1;
         unsigned int CWG3IF:1;
         unsigned int :1;
         unsigned int NCO1IF:1;
         unsigned int NVMIF:1;
         unsigned int CRCIF:1;
         unsigned int SCANIF:1;
      };

      struct {
         unsigned int :4;
         unsigned int NCOIF:1;
      };
   };
} PIR7;
#byte PIR7 = 0x713

struct PIR8 {
   unsigned int SMT1IF:1;
   unsigned int SMT1PRAIF:1;
   unsigned int SMT1PWAIF:1;
   unsigned int SMT2IF:1;
   unsigned int SMT2PRAIF:1;
   unsigned int SMT2PWAIF:1;
} PIR8;
#byte PIR8 = 0x714

struct PIE0 {
   unsigned int INTE:1;
   unsigned int :3;
   unsigned int IOCIE:1;
   unsigned int TMR0IE:1;
} PIE0;
#byte PIE0 = 0x716

struct PIE1 {
   unsigned int ADIE:1;
   unsigned int ADTIE:1;
   unsigned int :4;
   unsigned int CSWIE:1;
   unsigned int OSFIE:1;
} PIE1;
#byte PIE1 = 0x717

struct PIE2 {
   unsigned int C1IE:1;
   unsigned int C2IE:1;
   unsigned int :4;
   unsigned int ZCDIE:1;
} PIE2;
#byte PIE2 = 0x718

struct PIE3 {
   unsigned int SSP1IE:1;
   unsigned int BCL1IE:1;
   unsigned int SSP2IE:1;
   unsigned int BCL2IE:1;
   unsigned int TXIE:1;
   unsigned int RCIE:1;
} PIE3;
#byte PIE3 = 0x719

struct PIE4 {
   unsigned int TMR1IE:1;
   unsigned int TMR2IE:1;
   unsigned int TMR3IE:1;
   unsigned int TMR4IE:1;
   unsigned int TMR5IE:1;
   unsigned int TMR6IE:1;
} PIE4;
#byte PIE4 = 0x71A

struct PIE5 {
   unsigned int TMR1GIE:1;
   unsigned int TMR3GIE:1;
   unsigned int TMR5GIE:1;
   unsigned int :1;
   unsigned int CLC1IE:1;
   unsigned int CLC2IE:1;
   unsigned int CLC3IE:1;
   unsigned int CLC4IE:1;
} PIE5;
#byte PIE5 = 0x71B

struct PIE6 {
   unsigned int CCP1IE:1;
   unsigned int CCP2IE:1;
   unsigned int CCP3IE:1;
   unsigned int CCP4IE:1;
   unsigned int CCP5IE:1;
} PIE6;
#byte PIE6 = 0x71C

struct PIE7 {
   union {
      struct {
         unsigned int CWG1IE:1;
         unsigned int CWG2IE:1;
         unsigned int CWG3IE:1;
         unsigned int :1;
         unsigned int NCO1IE:1;
         unsigned int NVMIE:1;
         unsigned int CRCIE:1;
         unsigned int SCANIE:1;
      };

      struct {
         unsigned int :4;
         unsigned int NCOIE:1;
      };
   };
} PIE7;
#byte PIE7 = 0x71D

struct PIE8 {
   unsigned int SMT1IE:1;
   unsigned int SMT1PRAIE:1;
   unsigned int SMT1PWAIE:1;
   unsigned int SMT2IE:1;
   unsigned int SMT2PRAIE:1;
   unsigned int SMT2PWAIE:1;
} PIE8;
#byte PIE8 = 0x71E

struct PMD0 {
   unsigned int IOCMD:1;
   unsigned int CLKRMD:1;
   unsigned int NVMMD:1;
   unsigned int SCANMD:1;
   unsigned int CRCMD:1;
   unsigned int :1;
   unsigned int FVRMD:1;
   unsigned int SYSCMD:1;
} PMD0;
#byte PMD0 = 0x796

struct PMD1 {
   union {
      struct {
         unsigned int TMR0MD:1;
         unsigned int TMR1MD:1;
         unsigned int TMR2MD:1;
         unsigned int TMR3MD:1;
         unsigned int TMR4MD:1;
         unsigned int TMR5MD:1;
         unsigned int TMR6MD:1;
         unsigned int NCOMD:1;
      };

      struct {
         unsigned int :7;
         unsigned int NCO1MD:1;
      };
   };
} PMD1;
#byte PMD1 = 0x797

struct PMD2 {
   unsigned int ZCDMD:1;
   unsigned int CMP1MD:1;
   unsigned int CMP2MD:1;
   unsigned int :2;
   unsigned int ADCMD:1;
   unsigned int DACMD:1;
} PMD2;
#byte PMD2 = 0x798

struct PMD3 {
   unsigned int CCP1MD:1;
   unsigned int CCP2MD:1;
   unsigned int CCP3MD:1;
   unsigned int CCP4MD:1;
   unsigned int CCP5MD:1;
   unsigned int PWM6MD:1;
   unsigned int PWM7MD:1;
} PMD3;
#byte PMD3 = 0x799

struct PMD4 {
   unsigned int CWG1MD:1;
   unsigned int CWG2MD:1;
   unsigned int CWG3MD:1;
   unsigned int :1;
   unsigned int MSSP1MD:1;
   unsigned int MSSP2MD:1;
   unsigned int UART1MD:1;
} PMD4;
#byte PMD4 = 0x79A

struct PMD5 {
   unsigned int DSMMD:1;
   unsigned int CLC1MD:1;
   unsigned int CLC2MD:1;
   unsigned int CLC3MD:1;
   unsigned int CLC4MD:1;
   unsigned int :1;
   unsigned int SMT1MD:1;
   unsigned int SMT2MD:1;
} PMD5;
#byte PMD5 = 0x79B

struct WDTCON0 {
   union {
      struct {
         unsigned int SEN:1;
         unsigned int WDTPS:5;
      };

   union {
      struct {
         unsigned int SWDTEN:1;
      };
   };

      struct {
         unsigned int WDTSEN:1;
      };
   };
} WDTCON0;
#byte WDTCON0 = 0x80C

struct WDTCON1 {
   union {
      struct {
         unsigned int WINDOW:3;
         unsigned int :1;
         unsigned int WDTCS:3;
      };

      struct {
         unsigned int WDTWINDOW:3;
      };
   };
} WDTCON1;
#byte WDTCON1 = 0x80D

struct WDTPSL {
   union {
      struct {
         unsigned int PSCNT:8;
      };

      struct {
         unsigned int WDTPSCNT:8;
      };
   };
} WDTPS;
#byte WDTPS = 0x80E

struct WDTPSH {
   union {
      struct {
         unsigned int PSCNT8:2;
         unsigned int PSCNT1:6;
      };

      struct {
         unsigned int WDTPSCNT8:2;
         unsigned int WDTPSCNT1:6;
      };
   };
} WDTPSH;
#byte WDTPSH = 0x80F

struct WDTTMR {
   union {
      struct {
         unsigned int PSCNT16:2;
         unsigned int STATE:1;
         unsigned int WDTTMR:5;
      };

      struct {
         unsigned int WDTPSCNT16:2;
         unsigned int WDTSTATE:1;
      };
   };
} WDTTMR;
#byte WDTTMR = 0x810

struct BORCON {
   unsigned int BORRDY:1;
   unsigned int :6;
   unsigned int SBOREN:1;
} BORCON;
#byte BORCON = 0x811


struct VREGCON {
   unsigned int :1;
   unsigned int VREGPM:1;
} VREGCON;
#byte VREGCON = 0x812

struct PCON0 {
   unsigned int BOR:1;
   unsigned int POR:1;
   unsigned int RI:1;
   unsigned int RMCLR:1;
   unsigned int RWDT:1;
   unsigned int WDTWV:1;
   unsigned int STKUNF:1;
   unsigned int STKOVF:1;
} PCON0;
#byte PCON0 = 0x813

struct CCDCON {
   unsigned int CCDS:2;
   unsigned int :5;
   unsigned int CCDEN:1;
} CCDCON;
#byte CCDCON = 0x814

