Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
struct NVMADR {
   unsigned int NVMADR:8;
} NVMADR;
#byte NVMADR = 0x81A

struct NVMADRH {
   unsigned int NVMADR8:2;
   unsigned int NVMADR1:5;
} NVMADRH;
#byte NVMADRH = 0x81B

struct NVMDAT {
   unsigned int NVMDAT:8;
} NVMDAT;
#byte NVMDAT = 0x81C

struct NVMDATH {
   unsigned int NVMDAT8:2;
   unsigned int NVMDAT1:4;
} NVMDATH;
#byte NVMDATH = 0x81D

struct NVMCON1 {
   unsigned int RD:1;
   unsigned int WR:1;
   unsigned int WREN:1;
   unsigned int WRERR:1;
   unsigned int FREE:1;
   unsigned int LWLO:1;
   unsigned int NVMREGS:1;
} NVMCON1;
#byte NVMCON1 = 0x81E

#byte NVMCON2 = 0x81F

struct CPUDOZE {
   unsigned int DOZE:3;
   unsigned int :1;
   unsigned int DOE:1;
   unsigned int ROI:1;
   unsigned int DOZEN:1;
   unsigned int IDLEN:1;
} CPUDOZE;
#byte CPUDOZE = 0x88C

struct OSCCON1 {
   unsigned int NDIV:4;
   unsigned int NOSC:3;
} OSCCON1;
#byte OSCCON1 = 0x88D

struct OSCCON2 {
   unsigned int CDIV:4;
   unsigned int COSC:3;
} OSCCON2;
#byte OSCCON2 = 0x88E

struct OSCCON3 {
   unsigned int :3;
   unsigned int NOSCR:1;
   unsigned int ORDY:1;
   unsigned int :1;
   unsigned int SOSCPWR:1;
   unsigned int CSWHOLD:1;
} OSCCON3;
#byte OSCCON3 = 0x88F

struct OSCSTAT {
   unsigned int PLLR:1;
   unsigned int :1;
   unsigned int ADOR:1;
   unsigned int SOR:1;
   unsigned int LFOR:1;
   unsigned int MFOR:1;
   unsigned int HFOR:1;
   unsigned int EXTOR:1;
} OSCSTAT;
#byte OSCSTAT = 0x890

struct OSCEN {
   unsigned int :2;
   unsigned int ADOEN:1;
   unsigned int SOSCEN:1;
   unsigned int LFOEN:1;
   unsigned int MFOEN:1;
   unsigned int HFOEN:1;
   unsigned int EXTOEN:1;
} OSCEN;
#byte OSCEN = 0x891

#byte OSCTUNE = 0x892

#byte OSCFRQ = 0x893

struct CLKRCON {
   unsigned int CLKRDIV:3;
   unsigned int CLKRDC:2;
   unsigned int :2;
   unsigned int CLKREN:1;
} CLKRCON;
#byte CLKRCON = 0x895

#byte CLKRCLK = 0x896

struct MDCON0 {
   unsigned int MDBIT:1;
   unsigned int :3;
   unsigned int MDOPOL:1;
   unsigned int MDOUT:1;
   unsigned int :1;
   unsigned int MDEN:1;
} MDCON0;
#byte MDCON0 = 0x897

struct MDCON1 {
   unsigned int MDCLSYNC:1;
   unsigned int MDCLPOL:1;
   unsigned int :2;
   unsigned int MDCHSYNC:1;
   unsigned int MDCHPOL:1;
} MDCON1;
#byte MDCON1 = 0x898

#byte MDSRC = 0x899

#word MDCAR = 0x89A

struct FVRCON {
   unsigned int ADFVR:2;
   unsigned int CDAFVR:2;
   unsigned int TSRNG:1;
   unsigned int TSEN:1;
   unsigned int FVRRDY:1;
   unsigned int FVREN:1;
} FVRCON;
#byte FVRCON = 0x90C

struct DAC1CON0 {
   union {
      struct {
         unsigned int NSS:1;
         unsigned int :1;
         unsigned int PSS:2;
         unsigned int OE2:1;
         unsigned int OE1:1;
         unsigned int :1;
         unsigned int EN:1;
      };

      struct {
         unsigned int DAC1NSS:1;
         unsigned int :1;
         unsigned int DAC1PSS:2;
         unsigned int DAC1OE2:1;
         unsigned int DAC1OE1:1;
         unsigned int :1;
         unsigned int DAC1EN:1;
      };
   };
} DAC1CON0;
#byte DAC1CON0 = 0x90E

#byte DAC1CON1 = 0x90F

struct ZCD1CON {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int :2;
         unsigned int POL:1;
         unsigned int OUT:1;
         unsigned int :1;
         unsigned int EN:1;
      };

   union {
      struct {
         unsigned int ZCD1INTN:1;
         unsigned int ZCD1INTP:1;
         unsigned int :2;
         unsigned int ZCD1POL:1;
         unsigned int ZCD1OUT:1;
         unsigned int :1;
         unsigned int ZCD1EN:1;
      };
   };

      struct {
         unsigned int ZCDINTN:1;
         unsigned int ZCDINTP:1;
         unsigned int :2;
         unsigned int ZCDPOL:1;
         unsigned int ZCDOUT:1;
         unsigned int :1;
         unsigned int ZCDEN:1;
      };
   };
} ZCD1CON;
#byte ZCD1CON = 0x91F

struct CMOUT {
   union {
      struct {
         unsigned int MC1OUT:1;
         unsigned int MC2OUT:1;
      };

      struct {
         unsigned int C1OUT:1;
         unsigned int C2OUT:1;
      };
   };
} CMOUT;
#byte CMOUT = 0x98F

struct CM1CON0 {
   union {
      struct {
         unsigned int SYNC:1;
         unsigned int HYS:1;
         unsigned int Reserved:1;
         unsigned int ZLF:1;
         unsigned int POL:1;
         unsigned int OE:1;
         unsigned int OUT:1;
         unsigned int ON:1;
      };

      struct {
         unsigned int C1SYNC:1;
         unsigned int C1HYS:1;
         unsigned int C1SP:1;
         unsigned int C1ZLF:1;
         unsigned int C1POL:1;
         unsigned int C1OE:1;
         unsigned int C1OUT:1;
         unsigned int C1ON:1;
      };
   };
} CM1CON0;
#byte CM1CON0 = 0x990

struct CM1CON1 {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
      };

      struct {
         unsigned int C1INTN:1;
         unsigned int C1INTP:1;
      };
   };
} CM1CON1;
#byte CM1CON1 = 0x991

#byte CM1NSEL = 0x992

#byte CM1PSEL = 0x993

struct CM2CON0 {
   union {
      struct {
         unsigned int SYNC:1;
         unsigned int HYS:1;
         unsigned int Reserved:1;
         unsigned int ZLF:1;
         unsigned int POL:1;
         unsigned int OE:1;
         unsigned int OUT:1;
         unsigned int ON:1;
      };

      struct {
         unsigned int C2SYNC:1;
         unsigned int C2HYS:1;
         unsigned int C2SP:1;
         unsigned int C2ZLF:1;
         unsigned int C2POL:1;
         unsigned int C2OE:1;
         unsigned int C2OUT:1;
         unsigned int C2ON:1;
      };
   };
} CM2CON0;
#byte CM2CON0 = 0x994

struct CM2CON1 {
   union {
      struct {
         unsigned int INTN:1;
         unsigned int INTP:1;
      };

      struct {
         unsigned int C2INTN:1;
         unsigned int C2INTP:1;
      };
   };
} CM2CON1;
#byte CM2CON1 = 0x995

#byte CM2NSEL = 0x996

#byte CM2PSEL = 0x997

struct CLCDATA {
   unsigned int MLC1OUT:1;
   unsigned int MLC2OUT:1;
   unsigned int MLC3OUT:1;
   unsigned int MLC4OUT:1;
} CLCDATA;
#byte CLCDATA = 0xE0F

struct CLC1CON {
   union {
      struct {
         unsigned int LC1MODE:3;
         unsigned int LC1INTN:1;
         unsigned int LC1INTP:1;
         unsigned int LC1OUT:1;
         unsigned int LC1OE:1;
         unsigned int LC1EN:1;
      };

