Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
      struct {
         unsigned int MODE:3;
         unsigned int INTN:1;
         unsigned int INTP:1;
         unsigned int OUT:1;
         unsigned int OE:1;
         unsigned int EN:1;
      };
   };
} CLC4CON;
#byte CLC4CON = 0xE2E

struct CLC4POL {
   union {
      struct {
         unsigned int LC4G1POL:1;
         unsigned int LC4G2POL:1;
         unsigned int LC4G3POL:1;
         unsigned int LC4G4POL:1;
         unsigned int :3;
         unsigned int LC4POL:1;
      };

      struct {
         unsigned int G1POL:1;
         unsigned int G2POL:1;
         unsigned int G3POL:1;
         unsigned int G4POL:1;
         unsigned int :3;
         unsigned int POL:1;
      };
   };
} CLC4POL;
#byte CLC4POL = 0xE2F

struct CLC4SEL0 {
   union {
      struct {
         unsigned int LC4D1S:8;
      };

      struct {
         unsigned int D1S:8;
      };
   };
} CLC4SEL0;
#byte CLC4SEL0 = 0xE30

struct CLC4SEL1 {
   union {
      struct {
         unsigned int LC4D2S:8;
      };

      struct {
         unsigned int D2S:8;
      };
   };
} CLC4SEL1;
#byte CLC4SEL1 = 0xE31

struct CLC4SEL2 {
   union {
      struct {
         unsigned int LC4D3S:8;
      };

      struct {
         unsigned int D3S:8;
      };
   };
} CLC4SEL2;
#byte CLC4SEL2 = 0xE32

struct CLC4SEL3 {
   union {
      struct {
         unsigned int LC4D4S:8;
      };

      struct {
         unsigned int D4S:8;
      };
   };
} CLC4SEL3;
#byte CLC4SEL3 = 0xE33

struct CLC4GLS0 {
   union {
      struct {
         unsigned int LC4G1D1N:1;
         unsigned int LC4G1D1T:1;
         unsigned int LC4G1D2N:1;
         unsigned int LC4G1D2T:1;
         unsigned int LC4G1D3N:1;
         unsigned int LC4G1D3T:1;
         unsigned int LC4G1D4N:1;
         unsigned int LC4G1D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS0;
#byte CLC4GLS0 = 0xE34

struct CLC4GLS1 {
   union {
      struct {
         unsigned int LC4G2D1N:1;
         unsigned int LC4G2D1T:1;
         unsigned int LC4G2D2N:1;
         unsigned int LC4G2D2T:1;
         unsigned int LC4G2D3N:1;
         unsigned int LC4G2D3T:1;
         unsigned int LC4G2D4N:1;
         unsigned int LC4G2D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS1;
#byte CLC4GLS1 = 0xE35

struct CLC4GLS2 {
   union {
      struct {
         unsigned int LC4G3D1N:1;
         unsigned int LC4G3D1T:1;
         unsigned int LC4G3D2N:1;
         unsigned int LC4G3D2T:1;
         unsigned int LC4G3D3N:1;
         unsigned int LC4G3D3T:1;
         unsigned int LC4G3D4N:1;
         unsigned int LC4G3D4T:1;
      };

      struct {
         unsigned int D1N:1;
         unsigned int D1T:1;
         unsigned int D2N:1;
         unsigned int D2T:1;
         unsigned int D3N:1;
         unsigned int D3T:1;
         unsigned int D4N:1;
         unsigned int D4T:1;
      };
   };
} CLC4GLS2;
#byte CLC4GLS2 = 0xE36

struct CLC4GLS3 {
   union {
      struct {
         unsigned int LC4G4D1N:1;
         unsigned int LC4G4D1T:1;
         unsigned int LC4G4D2N:1;
         unsigned int LC4G4D2T:1;
         unsigned int LC4G4D3N:1;
         unsigned int LC4G4D3T:1;
         unsigned int LC4G4D4N:1;
         unsigned int LC4G4D4T:1;
      };

      struct {
         unsigned int G4D1N:1;
         unsigned int G4D1T:1;
         unsigned int G4D2N:1;
         unsigned int G4D2T:1;
         unsigned int G4D3N:1;
         unsigned int G4D3T:1;
         unsigned int G4D4N:1;
         unsigned int G4D4T:1;
      };
   };
} CLC4GLS3;
#byte CLC4GLS3 = 0xE37

struct PPSLOCK {
   unsigned int PPSLOCKED:1;
} PPSLOCK;
#byte PPSLOCK = 0xE8F

#byte INTPPS = 0xE90

#byte T0CKIPPS = 0xE91

#byte T1CKIPPS = 0xE92

#byte T1GPPS = 0xE93

#byte T3CKIPPS = 0xE94

#byte T3GPPS = 0xE95

#byte T5CKIPPS = 0xE96

#byte T5GPPS = 0xE97

#byte T2AINPPS = 0xE9C

#byte T4AINPPS = 0xE9D

#byte T6AINPPS = 0xE9E

#byte CCP1PPS = 0xEA1

#byte CCP2PPS = 0xEA2

#byte CCP3PPS = 0xEA3

#byte CCP4PPS = 0xEA4

#byte CCP5PPS = 0xEA5

#byte SMT1WINPPS = 0xEA9

#byte SMT1SIGPPS = 0xEAA

#byte SMT2WINPPS = 0xEAB

#byte SMT2SIGPPS = 0xEAC

#byte CWG1PPS = 0xEB1

#byte CWG2PPS = 0xEB2

#byte CWG3PPS = 0xEB3

#byte MDCARLPPS = 0xEB8

#byte MDCARHPPS = 0xEB9

#byte MDSRCPPS = 0xEBA

#byte CLCIN0PPS = 0xEBB

#byte CLCIN1PPS = 0xEBC

#byte CLCIN2PPS = 0xEBD

#byte CLCIN3PPS = 0xEBE

#byte ADCACTPPS = 0xEC3

#byte SSP1CLKPPS = 0xEC5

#byte SSP1DATPPS = 0xEC6

#byte SSP1SSPPS = 0xEC7

#byte SSP2CLKPPS = 0xEC8

#byte SSP2DATPPS = 0xEC9

#byte SSP2SSPPS = 0xECA

#byte RXPPS = 0xECB

#byte TXPPS = 0xECC

#byte RA0PPS = 0xF10

#byte RA1PPS = 0xF11

#byte RA2PPS = 0xF12

#byte RA3PPS = 0xF13

#byte RA4PPS = 0xF14

#byte RA5PPS = 0xF15

#byte RA6PPS = 0xF16

#byte RA7PPS = 0xF17

#byte RB0PPS = 0xF18

#byte RB1PPS = 0xF19

#byte RB2PPS = 0xF1A

#byte RB3PPS = 0xF1B

#byte RB4PPS = 0xF1C

#byte RB5PPS = 0xF1D

#byte RB6PPS = 0xF1E

#byte RB7PPS = 0xF1F

#byte RC0PPS = 0xF20

#byte RC1PPS = 0xF21

#byte RC2PPS = 0xF22

#byte RC3PPS = 0xF23

#byte RC4PPS = 0xF24

#byte RC5PPS = 0xF25

#byte RC6PPS = 0xF26

#byte RC7PPS = 0xF27

struct ANSELA {
   unsigned int ANSA:8;
} ANSELA;
#byte ANSELA = 0xF38

struct WPUA {
   unsigned int WPUA:8;
} WPUA;
#byte WPUA = 0xF39

struct ODCONA {
   unsigned int ODCA:8;
} ODCONA;
#byte ODCONA = 0xF3A

struct SLRCONA {
   unsigned int SLRA:8;
} SLRCONA;
#byte SLRCONA = 0xF3B

struct INLVLA {
   unsigned int INLVLA:8;
} INLVLA;
#byte INLVLA = 0xF3C

struct IOCAP {
   unsigned int IOCAP:8;
} IOCAP;
#byte IOCAP = 0xF3D

struct IOCAN {
   unsigned int IOCAN:8;
} IOCAN;
#byte IOCAN = 0xF3E

struct IOCAF {
   unsigned int IOCAF:8;
} IOCAF;
#byte IOCAF = 0xF3F

struct CCDNA {
   unsigned int CCDNA:8;
} CCDNA;
