Ismael-Stark/GitHub_Clases_UPPue/Programacion de Perifericos/2023/PIC/Clase1/PIC16F18855_registers.h
#byte CCDNA = 0xF40

struct CCDPA {
   unsigned int CCDPA:8;
} CCDPA;
#byte CCDPA = 0xF41

struct ANSELB {
   unsigned int ANSB:8;
} ANSELB;
#byte ANSELB = 0xF43

struct WPUB {
   unsigned int WPUB:8;
} WPUB;
#byte WPUB = 0xF44

struct ODCONB {
   unsigned int ODCB:8;
} ODCONB;
#byte ODCONB = 0xF45

struct SLRCONB {
   unsigned int SLRB:8;
} SLRCONB;
#byte SLRCONB = 0xF46

struct INLVLB {
   unsigned int INLVLB:8;
} INLVLB;
#byte INLVLB = 0xF47

struct IOCBP {
   unsigned int IOCBP:8;
} IOCBP;
#byte IOCBP = 0xF48

struct IOCBN {
   unsigned int IOCBN:8;
} IOCBN;
#byte IOCBN = 0xF49

struct IOCBF {
   unsigned int IOCBF:8;
} IOCBF;
#byte IOCBF = 0xF4A

struct CCDNB {
   unsigned int CCDNB:8;
} CCDNB;
#byte CCDNB = 0xF4B

struct CCDPB {
   unsigned int CCDPB:8;
} CCDPB;
#byte CCDPB = 0xF4C

struct ANSELC {
   unsigned int ANSC:8;
} ANSELC;
#byte ANSELC = 0xF4E

struct WPUC {
   unsigned int WPUC:8;
} WPUC;
#byte WPUC = 0xF4F

struct ODCONC {
   unsigned int ODCC:8;
} ODCONC;
#byte ODCONC = 0xF50

struct SLRCONC {
   unsigned int SLRC:8;
} SLRCONC;
#byte SLRCONC = 0xF51

struct INLVLC {
   unsigned int INLVLC:8;
} INLVLC;
#byte INLVLC = 0xF52

struct IOCCP {
   unsigned int IOCCP:8;
} IOCCP;
#byte IOCCP = 0xF53

struct IOCCN {
   unsigned int IOCCN:8;
} IOCCN;
#byte IOCCN = 0xF54

struct IOCCF {
   unsigned int IOCCF:8;
} IOCCF;
#byte IOCCF = 0xF55

struct CCDNC {
   unsigned int CCDNC:8;
} CCDNC;
#byte CCDNC = 0xF56

struct CCDPC {
   unsigned int CCDPC:8;
} CCDPC;
#byte CCDPC = 0xF57

struct WPUE {
   unsigned int :3;
   unsigned int WPUE3:1;
} WPUE;
#byte WPUE = 0xF65

struct INLVLE {
   unsigned int :3;
   unsigned int INLVLE3:1;
} INLVLE;
#byte INLVLE = 0xF68

struct IOCEP {
   unsigned int :3;
   unsigned int IOCEP3:1;
} IOCEP;
#byte IOCEP = 0xF69

struct IOCEN {
   unsigned int :3;
   unsigned int IOCEN3:1;
} IOCEN;
#byte IOCEN = 0xF6A

struct IOCEF {
   unsigned int :3;
   unsigned int IOCEF3:1;
} IOCEF;
#byte IOCEF = 0xF6B

struct STATUS_SHAD {
   unsigned int C_SHAD:1;
   unsigned int DC_SHAD:1;
   unsigned int Z_SHAD:1;
} STATUS_SHAD;
#byte STATUS_SHAD = 0xFE4

#byte WREG_SHAD = 0xFE5

#byte BSR_SHAD = 0xFE6

#byte PCLATH_SHAD = 0xFE7

#byte FSR0L_SHAD = 0xFE8

#byte FSR0H_SHAD = 0xFE9

#byte FSR1L_SHAD = 0xFEA

#byte FSR1H_SHAD = 0xFEB

#byte STKPTR = 0xFED

#word TOS = 0xFEE

